[
  {
    "id": "iLDGd6HW7fg",
    "title": "Lesson 9 – Checkmate: How Does the Game End?",
    "desc": "In this lesson, we explore one of the most important rules in chess: Check and Checkmate. What does check mean, how to defend, and when does the game end? Clear, beginner-friendly examples explain everything step by step."
  },
  {
    "id": "MFeHiMQWjNM",
    "title": "Lesson 8 – Castling & Pawn Promotion – Special Chess Rules",
    "desc": "Two powerful rules: castle to safeguard your king, and promote pawns to win endgames. See short vs. long castling ideas, plus promotion tactics. Clear demonstrations help you apply them with confidence."
  },
  {
    "id": "g9u5GYLMbas",
    "title": "Lesson 7 – How the Pawn Moves – The Brave Soldiers of Chess",
    "desc": "Pawns define structure: chains, weaknesses, and space. Learn pushes, captures, en passant, and how to create passed pawns. Practical examples show how pawn play shapes your plans."
  },
  {
    "id": "Vk41-Htu5ec",
    "title": "Lesson 6 – How the King Moves – The Most Valuable Chess Piece",
    "desc": "The king is slow but vital—protect it early and activate it in endgames. We show safe castling ideas, opposition concepts, and key endgame paths. Build habits that keep your king safe and useful."
  },
  {
    "id": "IsgdXyrocj0",
    "title": "Lesson 5 – How the Knight Moves – Master the L Shape in Chess",
    "desc": "Knights jump, fork, and create threats in crowded positions. Learn typical knight outposts, tactical forks, and coordination with pawns. Practical motifs to punish loose pieces and weak kings."
  },
  {
    "id": "0excNSDwJgs",
    "title": "Lesson 4 – How the Queen Moves – Rule the Board",
    "desc": "Explore the queen’s unmatched mobility and how to use it safely. Avoid quick blunders while maximizing pressure on weak squares. Learn when early queen activity helps—and when it hurts."
  },
  {
    "id": "SzdapHvzK7s",
    "title": "Lesson 3 – How the Bishop Moves – Master the Diagonal",
    "desc": "Understand diagonal control and the strength of bishop pairs. We explain open vs. closed positions and when bishops outperform knights. Practical tips to coordinate bishops with your plan."
  },
  {
    "id": "GCLKoaeLbKU",
    "title": "Lesson 2 – How the Rook Moves – Learn to Control the Board!",
    "desc": "Master files and ranks with the rook’s long-range power. See typical tactics, common traps, and practical patterns to improve control. Clear examples show when the rook becomes a true game changer."
  },
  {
    "id": "0B7cxBB6puo",
    "title": "Lesson 1 – Chess Pieces and Board – Chess Rules",
    "desc": "Learn the board layout, coordinates, and how each piece moves. We cover the basic rules and the essential language of chess. Perfect for absolute beginners who want a clean, fast start."
  },
  {
    "id": "DiRKo4k3psw",
    "title": "The History of Chess – 1500 Years of Strategy and Mind",
    "desc": "From ancient India to the modern world, discover how chess evolved into the game we love today. We look at cultural milestones, rules that changed the course of play, and legendary figures who shaped strategy. A concise journey that connects history with practical insight."
  }
]
