[
  {
  "id": "V7jvc8kQCh8",
  "title": "Lektion 9 – Schachmatt: Wie endet die Partie?",
  "desc": "In dieser Lektion lernen wir die wichtigste Schachregel kennen: Schach und Schachmatt. Was bedeutet Schach, wie kann man sich verteidigen und wann ist die Partie vorbei? Schritt für Schritt mit einfachen Beispielen erklärt."
  },
  {
    "id": "GIX6MI_fcwU",
    "title": "Lektion 8 – Rochade & Bauernumwandlung – Besondere Schachregeln",
    "desc": "Zwei Regeln mit großer Wirkung: Rochade bringt Sicherheit, Umwandlung bringt Siegchancen. Kurz/lang Rochade im Vergleich, plus saubere Umwandlungspläne. Klar erklärt, sofort anwendbar."
  },
  {
    "id": "UqtG0J6CV60",
    "title": "Lektion 7 – Wie sich der Bauer bewegt – Mutige Soldaten im Schach",
    "desc": "Bauern bestimmen Struktur, Raum und Schwächen. Wir erklären Vorstöße, Schlagzüge, en passant und Freibauern. Praxisnahe Beispiele führen direkt zu besseren Plänen."
  },
  {
    "id": "9rAIQcol76M",
    "title": "Lektion 6 – Der König – Die Wertvollste Figur im Schach",
    "desc": "Schütze den König im Aufbau, aktiviere ihn im Endspiel. Ideen zur Rochade, Opposition und zu entscheidenden Königswegen. Gewohnheiten, die Sicherheit und Aktivität verbinden."
  },
  {
    "id": "7K4sYWVwIIk",
    "title": "Lektion 5 – Der Springer – Die Kraft des L-Zugs im Schach",
    "desc": "Springer springen, gabeln und erzeugen Drohungen in dichten Stellungen. Lerne Vorposten, typische Gabeln und Zusammenarbeit mit Bauern. Motive, die lockere Figuren sofort bestrafen."
  },
  {
    "id": "KDErY0HuG1U",
    "title": "Lektion 4 – Die Dame – Herrscherin des Brettes",
    "desc": "Die Dame ist stark, aber anfällig. Wir zeigen sichere Manöver, Druck gegen schwache Felder und Risiken früher Aktivität. So nutzt du die Dame effektiv ohne Schnitzer."
  },
  {
    "id": "ROLo9oAjSfQ",
    "title": "Lektion 3 – Der Läufer – Die Macht der Diagonalen",
    "desc": "Diagonalen, Läuferpaar und offene/geschlossene Stellungen verstehen. Wann Läufer stärker als Springer sind – mit klaren Beispielen. Koordination der Läufer im Einklang mit dem Plan."
  },
  {
    "id": "rkehz75X80c",
    "title": "Lektion 2 – Wie zieht der Turm – Schach für Anfänger",
    "desc": "Kontrolle von Linien und Reihen mit Turm-Power. Typische Taktiken, Fallen und Aktivierungspläne im Überblick. Beispiele zeigen, wann der Turm die Partie kippt."
  },
  {
    "id": "wtwm5WvKPC0",
    "title": "Lektion 1 – Schachfiguren und Schachbrett – Schachregeln",
    "desc": "Aufbau des Bretts, Koordinaten und Grundregeln. Wir zeigen die Züge jeder Figur und die wichtigsten Basisprinzipien. Ideal für Einsteiger, die einen sauberen Start wollen."
  },
  {
    "id": "MLJFX46wXIQ",
    "title": "Die Geschichte des Schachs – 1500 Jahre Strategie und Geist",
    "desc": "Von den frühen Ursprüngen bis zur modernen Turnierwelt: wie sich Regeln, Figuren und Ideen entwickelt haben. Kulturelle Meilensteine und prägende Meister werden greifbar. Geschichte trifft praktische Einsicht."
  }
]
