[
  {
  "id": "q96MwW9Z3bQ",
  "title": "Ders 9 – Şah Mat: Oyun Nasıl Biter?",
  "desc": "Bu derste satrançtaki en önemli kuralı öğreniyoruz: Şah ve Mat. Şah çekmek nedir, nasıl savunulur ve oyun hangi durumda biter? Yeni başlayanlar için anlaşılır örneklerle adım adım anlatıyoruz."
  },
  {
    "id": "fTMgEOHlQJo",
    "title": "Ders 8 – Rok ve Piyon Terfisi – Özel Kurallar",
    "desc": "Rok ile şahı güvene al, terfi ile son hamlede gücü artır. Kısa/uzun rok fikirleri ve terfi taktiklerini adım adım inceliyoruz. Pratik örneklerle oyuna hemen uygulayabilirsin."
  },
  {
    "id": "VXuffmzjv1w",
    "title": "Ders 7 – Piyonun Hareketleri – Cesur Askerler",
    "desc": "Piyon yapısı planlarını belirler: zincirler, zayıflıklar ve alan. İlerleme, alma, geçer piyon yaratma ve en passant’ı net örneklerle gör. Piyon oyununu anlayınca plan yapmak kolaylaşır."
  },
  {
    "id": "I9_miy_-7Kk",
    "title": "Ders 6 – Şahın Hareketleri – En Değerli Taş",
    "desc": "Şahı açılışta koru, oyun sonunda etkinleştir. Rok güvenliği, karşı karşıya gelme (opposition) ve kritik yürüyüş yollarını anlatıyoruz. Doğru alışkanlıklarla hem güvenli hem etkili bir şah oyunu kur."
  },
  {
    "id": "dEMOpRh-Yrg",
    "title": "Ders 5 – Atın Hareketleri – Satrançta L Hamlesinin Gücü",
    "desc": "Atlar kalabalık konumlarda çatal ve taktiklerle parlar. Sağlam karakollar, piyonlarla uyum ve tipik kombinasyonları öğren. Gevşek taşları cezalandırmayı pratik örneklerle pekiştir."
  },
  {
    "id": "0BSyeENEkKQ",
    "title": "Ders 4 – Vezirin Hareketleri – Tahtanın Hakimi",
    "desc": "Vezirin esnekliği büyük ama riskleri de var. Erken vezir çıkışının ne zaman işe yarayıp ne zaman sorun çıkardığını gösteriyoruz. Zayıf karelere baskı ve güvenli manevralar için pratik ipuçları var."
  },
  {
    "id": "GuSIqzH1a2s",
    "title": "Ders 3 – Filin Hareketleri – Çapraz Gücün Sırrı",
    "desc": "Çapraz kontrolü, çift fil üstünlüğü ve açık/kapalı konum farklarını açıklıyoruz. Fil-at karşılaştırmaları ve planlara etkisi anlaşılır örneklerle geliyor. Filleri planınla uyumlu kullanmayı öğren."
  },
  {
    "id": "iIjX_jN_NOY",
    "title": "Ders 2 – Kalenin Hareketleri – Satrançta Taşlar Nasıl Alınır",
    "desc": "Kalenin dikey-yatay gücüyle hat ve sütun hakimiyeti kurmayı öğren. Sık görülen taktikler ve tuzakları örneklerle gösteriyoruz. Doğru zamanda aktif kale oyunu nasıl fark yaratır, birlikte görüyoruz."
  },
  {
    "id": "pUgjpo46amY",
    "title": "Ders 1 – Satranç Taşları ve Tahta – Satranç Kuralları",
    "desc": "Tahta yapısı, koordinatlar ve taşların temel hareketleri. Oyunun dilini ve başlangıç prensiplerini sade şekilde öğretiyoruz. Yeni başlayanlar için hızlı ve net bir giriş."
  },
  {
    "id": "KTVDi6K0ckw",
    "title": "Satranç Tarihi – 1500 Yıllık Akıl Oyununun Hikayesi",
    "desc": "Satranç, Hindistan’dan dünyaya uzanan bir akıl yolculuğu. Kuralların ve taşların nasıl evrildiğini, ustaların oyunu nasıl şekillendirdiğini anlatıyoruz. Tarihi arka plan ile pratik satranç anlayışını birleştiriyoruz."
  }
]
